'''
EIP ：描述了以太坊平台的标准，包括核心协议说明，客户端API以及合约标准
EIP类型
Standard Track(标准跟踪)
描述了影响大多说或所有以太坊实现的任何更改，例如网络协议的更改，块或交易有效性规则的修改，应用程序标准/惯例的修改，以及影响使用以太
坊的应用程序的交互性的任何更改或添加。此外，EIP可以分为以下几类
Core(核心)
共识分叉的提升，以及不一定是共识关键（EIP5，EIP101）但是可能与“核心开发”相关的其他改进（例如，挖矿、节点策略改变，EIP86的2,3,4节）
Networking(网络)
包括围绕点对点开发和轻量点对点以太坊子协议的改进，以及对whisper和swarm的网络协议规范的任何改进建议。
Interface(接口)
包括有关客户端API/RPC规范和标准的改进，以及某些语言级标准，如方法名称（EIP6）和合约ABI。接口标签应该与接口repo对齐，讨论应该主要在
EIP提交到EIPS存储库之前进行。
ERC
应用程序级标准和约定，包括合约标准,比如Token Standard(代币标准)，(ERC137)注册表，URI方案（ERC681）,库/包格式(EIP90),钱包格式
（EIP85）.
Informational
描述了以太坊设计问题，向以太坊社会提供一般的指导或信息，但是不提供新的功能。Informational EIP不一定代表以太坊社区的共识或推荐，因
此用户和实施者可以自由地忽略Informational EIP。
Meta
描述了围绕以太坊或对建议对过程的修改的一个过程。流程EIP类似于Standard EIP，但适用于以太坊协议本身以外的区域。它们可能会提出一个实现，
但是不会提出以太坊的代码库；它们经常需要社区共识，与Informational EIP不同，它们不仅仅是建议，用户通常也不能忽视它们。示例，包括程序，
指南，决策过程的变更以及以太坊开发中的工具或环境的变更，任何meta-EIP被视为一个流程EIP。

'''